bp20-tests/src/test/java/org/jboss/test/ws/jaxws/bp12/wsa/test1190/wsa-version-mismatch.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
	<soap:Header>
		<Action xmlns="http://www.w3.org/2005/08/addressing">http://example.org/wsaTestService/wsaTestPortType/echo1Request
		</Action>
		<To xmlns="http://www.w3.org/2005/08/addressing">http://localhost:$PORT/jaxws-bp12test1190/Test1190</To>
		<ReplyTo xmlns="http://www.w3.org/2005/08/addressing">
			<Address>http://www.w3.org/2005/08/addressing/anonymous</Address>
		</ReplyTo>
	</soap:Header>
	<soap:Body>
		<echoIn1 xmlns="http://example.org/echo">input string</echoIn1>
	</soap:Body>
</soap:Envelope>